finding_trees.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-18 Fri 10:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Seeing the trees for the urban forest</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Seeing the trees for the urban forest</h1>
<hr />

<p>
The <a href="https://github.com/Jean-Romain/lidR/"><code>lidR</code> package</a> is an incredible tool for working with lidar data
in R.  It is specifically designed around forestry applications, which
is super handy because it has a number of algorithms for tree
identification and the like.  But one draw back is that its main use
environment was forests made up of only trees.  I work in forests
that have pesky buildings mixed in with the trees.  Separating trees
from buildings is essential to properly estimate forest
characteristics.
</p>

<p>
<code>lastools</code> has the <a href="https://rapidlasso.com/lastools/lasclassify/"><code>lasclassify</code> tool</a> to classify point clouds, but it
is not free.  By using the development version (as of
2019-10-18 Fri) of the lidR package and the function <a href="https://github.com/Jean-Romain/lidR/issues/276"><code>point_metrics</code></a>
along with the <code>detect_shape</code> function, I was able to pretty well
separate out the trees from buildings.  
</p>

<p>
I'm sure that both the parameters used in this workflow and the
workflow/code itself can be better optimized.  Suggestions welcome!
</p>


<p>
A quick note on this document: All the R code exists in one file
<a href="finding_trees.R">finding_trees.R</a>.  Run the code yourself to see all the other
plots.  I saved the rgl plots as htmlwidgets because I think that it
is handy to be able to move the point cloud around.  However, those
are large files, so I only saved 2.  Downloading the repository and
opening <code>finding_trees.html</code> in a browser will allow you the best
viewing experience (html widgets aren't shown in the github preview).
</p>



<div id="outline-container-org7d724e9" class="outline-2">
<h2 id="org7d724e9">load libraries</h2>
<div class="outline-text-2" id="text-org7d724e9">
<div class="org-src-container">
<pre class="src src-R">    <span style="color: #268bd2; font-weight: bold;">library</span>(devtools)
<span style="color: #586e75;"># </span><span style="color: #586e75;">need the development version (as of 2019-10-18 Fri) to get the point_metrics function.</span>
<span style="color: #586e75;"># </span><span style="color: #586e75;">the point metrics function is likely to change when released into the stable version which will probably break this code</span>
<span style="color: #586e75;"># </span><span style="color: #586e75;">but I hope the concept remains the same.</span>
  install_github(<span style="color: #2aa198;">"Jean-Romain/lidR"</span>, ref = <span style="color: #2aa198;">"devel"</span>)
    <span style="color: #268bd2; font-weight: bold;">library</span>(lidR) 
    <span style="color: #268bd2; font-weight: bold;">library</span>(rgl)
    <span style="color: #268bd2;">pct_x_is</span><span style="color: #268bd2; font-weight: bold;">&lt;-</span> <span style="color: #859900; font-weight: bold;">function</span>(x, is) {
        <span style="color: #859900; font-weight: bold;">return</span>(list(pct_x = sum(x == is) / length(x)))
        }
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2c9bbb" class="outline-2">
<h2 id="orge2c9bbb">look at the example lidar point cloud.  2016 lidar from Madison, WI</h2>
<div class="outline-text-2" id="text-orge2c9bbb">
<div class="org-src-container">
<pre class="src src-R">l <span style="color: #268bd2; font-weight: bold;">&lt;-</span> readLAS(<span style="color: #2aa198;">"test2016.las"</span>, filter = <span style="color: #2aa198;">"-drop_z_below 6 -keep_first"</span>)
plot(l)
lw <span style="color: #268bd2; font-weight: bold;">&lt;-</span> rglwidget()
htmlwidgets::saveWidget(lw, <span style="color: #2aa198;">"height.html"</span>)
</pre>
</div>

<ul class="org-ul">
<li>Scroll to zoom</li>
<li>left click and move to rotate</li>
<li>right click and move to pan (doesn't work in web browser)</li>
</ul>

<iframe src=height.html height=600px width=1100px ></iframe>
</div>
</div>

<div id="outline-container-orgc8383cd" class="outline-2">
<h2 id="orgc8383cd">find coplanar points and call them "building"</h2>
<div class="outline-text-2" id="text-orgc8383cd">
<div class="org-src-container">
<pre class="src src-R">lsp <span style="color: #268bd2; font-weight: bold;">&lt;-</span> lasdetectshape(l, shp_plane(th1 = 4, th2 = 4, k = 10), <span style="color: #2aa198;">"building"</span>)
plot(lsp, color = <span style="color: #2aa198;">"building"</span>, col = c(<span style="color: #2aa198;">"green"</span>, <span style="color: #2aa198;">"red"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8eb0906" class="outline-2">
<h2 id="org8eb0906">Use <code>point_metrics</code></h2>
<div class="outline-text-2" id="text-org8eb0906">
<p>
If a point has more than 60% of it's nearest k (50 in this case)
points assigned building, then it too is probably a building - assign
it to building. If a point has less than 40% of it's nearest k (50 in
this case) points assigned building, then it is probably not a
building - asign it to not building.
</p>
<div class="org-src-container">
<pre class="src src-R">  pm <span style="color: #268bd2; font-weight: bold;">&lt;-</span> point_metrics(lsp, ~pct_x_is(x = building, is = <span style="color: #b58900;">TRUE</span>), k = 50)

<span style="color: #586e75;"># </span><span style="color: #586e75;">uncomment this bit of code if you'd like to see what the "percent building" looks like.</span>
<span style="color: #586e75;">#  </span><span style="color: #586e75;">lsp &lt;- lasadddata(lsp, pm$pct_x, "pct_x")</span>
<span style="color: #586e75;">#  </span><span style="color: #586e75;">plot(lsp, color = "pct_x", trim = 1)</span>

  lsp@data$building[pm$pct_x &gt; .6] <span style="color: #268bd2; font-weight: bold;">&lt;-</span> <span style="color: #b58900;">TRUE</span>
  lsp@data$building[pm$pct_x &lt; .4] <span style="color: #268bd2; font-weight: bold;">&lt;-</span> <span style="color: #b58900;">FALSE</span>
  plot(lsp, color = <span style="color: #2aa198;">"building"</span>, col = c(<span style="color: #2aa198;">"green"</span>, <span style="color: #2aa198;">"red"</span>))
</pre>
</div>

<p>
This works surprisingly well!  But there powerlines and a tower on top
of a building that are assigned to tree/not building.
</p>
</div>
</div>

<div id="outline-container-org9fdbd75" class="outline-2">
<h2 id="org9fdbd75">Try to remove powerlines and tower using colinear shape detection</h2>
<div class="outline-text-2" id="text-org9fdbd75">
<div class="org-src-container">
<pre class="src src-R">lf <span style="color: #268bd2; font-weight: bold;">&lt;-</span> lasfilter(lsp, building == <span style="color: #b58900;">FALSE</span>)
lfl <span style="color: #268bd2; font-weight: bold;">&lt;-</span> lasdetectshape(lf, shp_line(th1 = 4, k = 15), <span style="color: #2aa198;">"building"</span>)
plot(lfl, color = <span style="color: #2aa198;">"building"</span>)
</pre>
</div>

<p>
Use <code>point_metrics</code> again.
</p>
<div class="org-src-container">
<pre class="src src-R">pm <span style="color: #268bd2; font-weight: bold;">&lt;-</span> point_metrics(lfl, ~pct_x_is(x = building, is = <span style="color: #b58900;">TRUE</span>), k = 30)

lfl@data$building[pm$pct_x &gt; .4] <span style="color: #268bd2; font-weight: bold;">&lt;-</span> <span style="color: #b58900;">TRUE</span>
lfl@data$building[pm$pct_x &lt; .1] <span style="color: #268bd2; font-weight: bold;">&lt;-</span> <span style="color: #b58900;">FALSE</span>
plot(lfl, color = <span style="color: #2aa198;">"building"</span>, col = c(<span style="color: #2aa198;">"green"</span>, <span style="color: #2aa198;">"red"</span>))
lf <span style="color: #268bd2; font-weight: bold;">&lt;-</span> lasfilter(lfl, building == <span style="color: #b58900;">FALSE</span>)

plot(lf)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">treesw <span style="color: #268bd2; font-weight: bold;">&lt;-</span> rglwidget()
htmlwidgets::saveWidget(treesw, <span style="color: #2aa198;">"trees.html"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5580ee3" class="outline-2">
<h2 id="org5580ee3">Result</h2>
<div class="outline-text-2" id="text-org5580ee3">
<p>
Here is the point cloud of just trees and the original points below it
for comparison:
</p>
<iframe src=trees.html height=600px width=1100px ></iframe>
<iframe src=height.html height=600px width=1100px ></iframe>
</div>
</div>

<div id="outline-container-orgbe94ee4" class="outline-2">
<h2 id="orgbe94ee4">Improvements to be made</h2>
<div class="outline-text-2" id="text-orgbe94ee4">
<p>
There are certainly still powerlines that I could not remove.  I could
probably play around more with the thresholds and the parameters that
I use.  Possibly call <code>point_metrics</code> iteratively, using smaller
neighborhoods first.  But for a first cut I think this is pretty
good.  Again, any suggestions for improvement are very welcome.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-10-18 Fri 10:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
